**Make sure to have a copy of the database file, "world-db", downloaded and in this directory for the below to work!**

In [2]:
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @None'

In [4]:
%%sql 
CREATE TABLE sailors(
  sid INTEGER PRIMARY KEY,
  sname CHAR(20),
  rating INTEGER,
  age REAL)

 * sqlite://
Done.

[]

In [5]:
%sql SELECT * FROM sailors;

 * sqlite://
Done.

[]

In [6]:
%sql INSERT INTO sailors VALUES (22, 'Dustin', 7, 45.0)

 * sqlite://
1 rows affected.

[]

In [7]:
%sql SELECT * FROM sailors;

 * sqlite://
Done.

[(22, 'Dustin', 7, 45.0)]

In [8]:
%%sql
INSERT INTO sailors VALUES 
    (29, 'Brutus', 1, 33),
    (31, 'Lubber', 8, 55)

 * sqlite://
2 rows affected.

[]

In [9]:
%%sql
INSERT INTO sailors VALUES 
    (32, 'Andy', 8, 25),
    (58, 'Rusty', 10, 35),
    (64, 'Horatio', 7, 35),
    (71, 'Zorba', 10, 16),
    (74, 'Horato', 9, 35)

 * sqlite://
5 rows affected.

[]

In [10]:
%sql SELECT * FROM sailors;

 * sqlite://
Done.

[(22, 'Dustin', 7, 45.0),
 (29, 'Brutus', 1, 33.0),
 (31, 'Lubber', 8, 55.0),
 (32, 'Andy', 8, 25.0),
 (58, 'Rusty', 10, 35.0),
 (64, 'Horatio', 7, 35.0),
 (71, 'Zorba', 10, 16.0),
 (74, 'Horato', 9, 35.0)]

In [21]:
%%sql
SELECT sname AS SailorName
FROM sailors
WHERE rating > 7

 * sqlite://
Done.

[('Lubber',), ('Andy',), ('Rusty',), ('Zorba',), ('Horato',)]

In [76]:
%%sql
SELECT sname, (60 - age) AS YearToRetire
FROM sailors
WHERE rating > 7;

 * sqlite://
Done.

[('Lubber', 5.0),
 ('Andy', 35.0),
 ('Rusty', 25.0),
 ('Zorba', 44.0),
 ('Horato', 25.0)]

In [35]:
%%sql 
SELECT * 
FROM sailors
WHERE sname LIKE '%st%' OR age>50;

 * sqlite://
Done.

[(22, 'Dustin', 7, 45.0), (31, 'Lubber', 8, 55.0), (58, 'Rusty', 10, 35.0)]

In [39]:
%%sql
SELECT DISTINCT rating
FROM sailors;

 * sqlite://
Done.

[(7,), (1,), (8,), (10,), (9,)]

In [45]:
%%sql
SELECT sname, age
FROM sailors
WHERE age < 35
ORDER BY sname DESC;

 * sqlite://
Done.

[('Zorba', 16.0), ('Brutus', 33.0), ('Andy', 25.0)]

In [50]:
%%sql
SELECT * 
FROM sailors
ORDER BY age ASC
LIMIT 2

 * sqlite://
Done.

[(71, 'Zorba', 10, 16.0), (32, 'Andy', 8, 25.0)]

In [52]:
%%sql
SELECT AVG(age)
FROM sailors 
WHERE rating > 4

 * sqlite://
Done.

[(35.142857142857146,)]

In [77]:
%%sql SELECT sname, age 
FROM sailors
WHERE age = (SELECT MAX(age) FROM sailors);

 * sqlite://
Done.

[('Lubber', 55.0)]